{ "secondaryeducation" : [
    { "institution" : "Tallinn Technical Gymnasium",
      "start" : "1996",
      "end" : "1999" } ],
  "highereducation" : [
    { "institution" : "Tallinn Pedagogical University",
      "logo" : "logo-tlu.png",
      "major" : "Applied Informatics",
      "start" : "1999",
      "end" : "2003",
      "extra" : "The university later changed its name to Tallinn University"} ],
  "experience" : [
    { "title" : "Software Developer",
      "company" : "CGI",
      "logo" : "logo-cgi.png",
      "start" : "11-2015",
      "duration" : "3 years 11 months",
      "description" : "Maintaining a family of applications for self service kiosks used in various hospitals to register to appointments and receive in-doors map guidance to waiting areas of large buildings",
      "extra" : "Tools used involve Wildfly server, J2EE backend with Vaadin as frontend. Second part of the application suite is built using NodeJS" },
    { "title" : "Software Developer",
      "company" : "Navionics",
      "logo" : "logo-navionics.png",
      "start" : "11-2013",
      "end" : "09-2015",
      "duration" : "2 years",
      "description" : "Maintaining a family of Android applications: naval maps for Boating and resort maps for Ski",
      "extra" : "Tools used involve Android Development Tools. Both: native and java." },
    { "title" : "Applications Specialist / Server Developer",
      "company" : "Playtech OÜ",
      "logo" : "logo-playtech.png",
      "start" : "04-2010",
      "end" : "11-2013",
      "duration" : "3 years and 7 months",
      "description" : "Application Specialists part of the job is to look at server logs of production systems, to reply to client requests. <br />\nBased on logs need to make it clear whether the systems involved worked as expected, or whether there is something that could be changed in the system's behaviour.<br />\nFor a change, either a known issue exists to categorize the complaint under, or a fresh one could be created, so the development people could resolve them.<br />\nFrom time to time admins (production team) needed assistance in applying fixes (new versions of servers to different production environments)<br />\n<br />\nServer Developer tasks involved new features into gaming servers around and fixing bugs at existing services.<br />\n<br />\nAlso got involved in developing new generation of servers for better performance and reduced complexity.",
      "extra" : "Tools used include Java, unix/linux command line tools to browse around log files, PHP.<br />\nExperimented with new type of data stores like Redis and MongoDB." },
    { "title" : "Computer Programmer",
      "company" : "AS Helmes",
      "logo" : "logo-helmes.png",
      "start" : "07-2009",
      "end" : "02-2010",
      "duration" : "7 months",
      "description" : "Client Portal development  (Microlink)<br />\n<br />\nMisdemeanour Processing Portal<br />",
      "extra" : "Accomplishments:<br />\nAnother couple of Client Portal releases got done for Microlink;<br />\nPhase 1 of Misdemeanour Processing Portal got finished.<br />\n<br />\nTools used involve Java (ZK, Tapestry, Spring, Hibernate); Sun Glassfish, Oracle IAS; PostgreSQL, MS SQL Server<br />" },
    { "title" : "Software Developer",
      "company" : "Microlink Eesti AS",
      "logo" : "logo-microlink.png",
      "start" : "06-2006",
      "end" : "07-2009",
      "duration" : "3 years and 1 month",
      "description" : "Phone call as a service system<br />\n<br />\nMiscellanneous tasks for EMT projects <br />\n<br />\nClient Portal development<br />\n<br />\nLogistics system for garbage trucks<br />\n<br />\nIdentity management services<br />",
      "extra" : "MicroLink AS was merged with Elion, except for the software development team (including me), which went to Helmes AS.<br />\n<br />\nAccomplishments: Phone call as a services got built and set up. Later two more continuing projects got started, providing more functionality for the system.<br />\n<br />\nAt EMT that time the biggest project was Mobile ID related.<br />\n<br />\nWorking concept for the logistics system for garbage trucks got built. The operating system of small PC at car could either be Windows XP embedded or Linux.<br />\n<br />\nElions existing Identity management system was explored. Based on that solutions to elsewhere got offered.<br />\n<br />\nMultiple releases of Microlink Client Portal got done (mediated client requests from ServiceDesk to registered clients, gathered billing data for backup, sent reports to booking systems).<br />\n<br />\nTools used include Java (Spring, Hibernate, Tapestry, XFire), PHP, MapServer" },
    { "title" : "Software Developer",
      "company" : "Proekspert AS",
      "logo" : "logo-proekspert.png",
      "start" : "01-2006",
      "end" : "05-2006",
      "duration" : "4 months",
      "description" : "Electronic payment-card system for a certain terminal-device (having two ARM processors, equipped with chip-card reader, keyboard, display and printer).<br />" },
    { "title" : "Software Developer",
      "company" : "Profit Software AS",
      "start" : "02-2001",
      "end" : "11-2005",
      "duration" : "4 years and 9 months",
      "description" : "Insurance software develpment, documentation and testing.<br />\nTools used include Java, C++, DB2, WebSphere, Lotus Notes, ASP, WinRunner.<br />\nKeywords: J2EE and Struts, IBM open class library and SOM." } ]
}

